In [4]:
import pandas as pd
path = 'https://github.com/kflisikowsky/pandas_exercises/raw/6d1bee5449892050aea7be6515489de0c7f33de1/final_exam/pizza.xls'
df = pd.read_excel(path)
df.head()

   pizza  gender  city  college  satisfaction  income  age            type
0    109       1     0        0             5   25000   25      margharita
1    150       1     0        0             2   30000   45          hawaii
2    250       1     0        0             1   22000   20       carbonara
3    108       1     0        1             5   20000   28  frutti di mare
4    220       1     1        1             9   25000   25      margharita